Repository: zziri/cmux
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ar, bs, da, de, es, fr, it, ja, ko, nb, pl, pt_br, ru, th, tr, uk, zh_hans, zh_hant

# cli.mobile.compatibleTags.appliedNoDevice
source: Granted Mac dev tags for paired phones: %@ (applies when a phone next connects).
ar: تم منح علامات تطوير Mac للهواتف المقترنة: %@ (سيتم تطبيقها عند اتصال الهاتف في المرة القادمة).
de: Mac-Entwickler-Tags für gekoppelte Telefone gewährt: %@ (wird wirksam, wenn sich das nächste Mal ein Telefon verbindet).
es: Etiquetas de desarrollo de Mac otorgadas para teléfonos emparejados: %@ (se aplicarán cuando se conecte el próximo teléfono).
fr: Balises de développement Mac attribuées pour les téléphones jumelés : %@ (s'appliqueront lors de la prochaine connexion d'un téléphone).
ja: ペアリング済みの iPhone に許可した Mac 開発タグ: %@（次回接続時に適用されます）。
ko: 페어링된 휴대폰에 대한 Mac 개발자 태그 부여됨: %@ (휴대폰이 다음에 연결될 때 적용됨).
zh_hans: 已为配对的手机授权 Mac 开发标记：%@（将在手机下次连接时生效）。
zh_hant: 已為配對的手機授予 Mac 開發標記：%@ (將在下次手機連線時套用)。

# cli.mobile.compatibleTags.empty
source: No additional Mac dev tags are granted to this Mac's paired phones.
ar: لم يتم منح علامات تطوير Mac إضافية للهواتف المقترنة بجهاز Mac هذا.
de: Den gekoppelten Telefonen dieses Macs werden keine zusätzlichen Mac-Entwickler-Tags gewährt.
es: No se otorgan etiquetas de desarrollo de Mac adicionales a los teléfonos emparejados de esta Mac.
fr: Aucun tag de développement Mac supplémentaire n'est accordé aux téléphones jumelés de ce Mac.
ja: この Mac のペアリング済み iPhone に追加で許可された Mac 開発タグはありません。
ko: 이 Mac과 페어링된 휴대폰에 추가로 부여된 Mac 개발자 태그가 없습니다.
zh_hans: 未向本机配对的手机授权额外的 Mac 开发标记。
zh_hant: 未向此 Mac 的配對手機授予額外的 Mac 開發標記。

# cli.mobile.compatibleTags.none
source: (none)
ar: (لا يوجد)
de: (keine)
es: (ninguno)
fr: (aucun)
ja: （なし）
ko: (없음)
zh_hans: （无）
zh_hant: (無)

# cli.mobile.compatibleTags.usage
source: Usage: cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
ar: الاستخدام: cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
de: Verwendung: cmux mobile compatible-tags [list|set <Tags...>|add <Tags...>|remove <Tags...>|clear]
es: Uso: cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
fr: Utilisation : cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
ja: 使い方: cmux mobile compatible-tags [list|set <タグ...>|add <タグ...>|remove <タグ...>|clear]
ko: 사용법: cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
zh_hans: 用法：cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]
zh_hant: 用法：cmux mobile compatible-tags [list|set <tags...>|add <tags...>|remove <tags...>|clear]

# cli.mobile.setFont.applied
source: Set mobile terminal font to %@pt on connected device(s).
ar: تم تعيين خط الطرفية المحمولة إلى %@ نقطة على الأجهزة المتصلة.
de: Schriftart des mobilen Terminals auf verbundenen Geräten auf %@pt festgelegt.
es: Se estableció la fuente de la terminal móvil en %@ pt en los dispositivos conectados.
fr: Police du terminal mobile définie sur %@ pt sur les appareils connectés.
ja: モバイルターミナルのフォントを %@pt に設定しました（接続中のデバイス）。
ko: 연결된 기기의 모바일 터미널 글꼴을 %@pt로 설정했습니다.
zh_hans: 已将已连接设备上的移动端终端字体设为 %@pt。
zh_hant: 已在已連線的裝置上將行動裝置終端機字型設為 %@pt。

# cli.mobile.setFont.appliedNoDevice
source: Set mobile terminal font to %@pt (no iOS device is currently connected).
ar: تم تعيين خط الطرفية المحمولة إلى %@ نقطة (لا يوجد جهاز iOS متصل حاليًا).
de: Schriftart des mobilen Terminals auf %@pt festgelegt (derzeit ist kein iOS-Gerät verbunden).
es: Se estableció la fuente de la terminal móvil en %@ pt (no hay ningún dispositivo iOS conectado actualmente).
fr: Police du terminal mobile définie sur %@ pt (aucun appareil iOS n'est connecté actuellement).
ja: モバイルターミナルのフォントを %@pt に設定しました（現在 iOS デバイスは接続されていません）。
ko: 모바일 터미널 글꼴을 %@pt로 설정했습니다 (현재 연결된 iOS 기기가 없습니다).
zh_hans: 已将移动端终端字体设为 %@pt（当前没有连接的 iOS 设备）。
zh_hant: 已將行動裝置終端機字型設為 %@pt (目前未連線任何 iOS 裝置)。

# cli.mobile.setFont.usage
source: Usage: cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
ar: الاستخدام: cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
de: Verwendung: cmux mobile set-font <Punkte> [--surface <ID>] [--workspace <ID>]
es: Uso: cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
fr: Utilisation : cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
ja: 使い方: cmux mobile set-font <ポイント数> [--surface <id>] [--workspace <id>]
ko: 사용법: cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
zh_hans: 用法：cmux mobile set-font <points> [--surface <id>] [--workspace <id>]
zh_hant: 用法：cmux mobile set-font <points> [--surface <id>] [--workspace <id>]

# cli.moshTmux.arguments.invalid
source: mosh-tmux accepts a destination and --session, not a separate remote command
ar: يقبل mosh-tmux وجهة و --session، وليس أمرًا بعيدًا منفصلًا
bs: mosh-tmux prihvata odredište i --session, a ne zasebnu udaljenu naredbu
da: mosh-tmux accepterer en destination og --session, ikke en separat fjernkommando
de: mosh-tmux akzeptiert ein Ziel und --session, aber keinen separaten Remote-Befehl
es: mosh-tmux acepta un destino y --session, no un comando remoto separado
fr: mosh-tmux accepte une destination et --session, pas une commande distante distincte
it: mosh-tmux accetta una destinazione e --session, non un comando remoto separato
ja: mosh-tmux は接続先と --session を受け付けます。別のリモートコマンドは指定できません
ko: mosh-tmux는 대상과 --session을 받으며 별도의 원격 명령은 받지 않습니다
nb: mosh-tmux godtar et mål og --session, ikke en separat ekstern kommando
pl: mosh-tmux przyjmuje cel i --session, a nie osobne zdalne polecenie
pt_br: mosh-tmux aceita um destino e --session, não um comando remoto separado
ru: mosh-tmux принимает адрес и --session, но не отдельную удалённую команду
th: mosh-tmux รับ destination และ --session ไม่รับ remote command แยกต่างหาก
tr: mosh-tmux bir hedef ve --session kabul eder, ayrı bir uzak komut kabul etmez
uk: mosh-tmux приймає адресу та --session, а не окрему віддалену команду
zh_hans: mosh-tmux 接受目标和 --session，不接受单独的远程命令
zh_hant: mosh-tmux 接受目的地與 --session，不接受獨立的遠端命令

# cli.moshTmux.session.invalid
source: mosh-tmux: --session requires a non-empty session name without hidden characters
ar: mosh-tmux: يتطلب --session اسم جلسة غير فارغ من دون محارف مخفية
bs: mosh-tmux: --session zahtijeva neprazno ime sesije bez skrivenih znakova
da: mosh-tmux: --session kræver et ikke-tomt sessionsnavn uden skjulte tegn
de: mosh-tmux: --session erfordert einen nicht leeren Sitzungsnamen ohne versteckte Zeichen
es: mosh-tmux: --session requiere un nombre de sesión no vacío y sin caracteres ocultos
fr: mosh-tmux : --session exige un nom de session non vide sans caractères masqués
it: mosh-tmux: --session richiede un nome di sessione non vuoto e senza caratteri nascosti
ja: mosh-tmux: --session には、隠し文字を含まない空でないセッション名が必要です
ko: mosh-tmux: --session에는 숨은 문자가 없는 비어 있지 않은 세션 이름이 필요합니다
nb: mosh-tmux: --session krever et ikke-tomt øktnavn uten skjulte tegn
pl: mosh-tmux: --session wymaga niepustej nazwy sesji bez ukrytych znaków
pt_br: mosh-tmux: --session exige um nome de sessão não vazio e sem caracteres ocultos
ru: mosh-tmux: --session требует непустое имя сеанса без скрытых символов
th: mosh-tmux: --session ต้องมีชื่อ session ที่ไม่ว่างและไม่มีอักขระซ่อน
tr: mosh-tmux: --session gizli karakter içermeyen, boş olmayan bir oturum adı gerektirir
uk: mosh-tmux: --session потребує непорожньої назви сеансу без прихованих символів
zh_hans: mosh-tmux：--session 需要一个不含隐藏字符的非空会话名称
zh_hant: mosh-tmux：--session 需要不含隱藏字元的非空工作階段名稱

# cli.newPane.help.profileDescription
source: --profile <name|uuid> Browser profile name or UUID
ar: --profile <name|uuid> اسم ملف تعريف المتصفح أو معرف UUID
de: --profile <Name|UUID> Browserprofilname oder -UUID
es: --profile <name|uuid> Nombre de perfil de navegador o UUID
fr: --profile <nom|uuid> Nom ou UUID du profil de navigateur
ja: --profile <名前|UUID> ブラウザープロファイル名または UUID
ko: --profile <name|uuid> 브라우저 프로필 이름 또는 UUID
zh_hans: --profile <name|uuid> 浏览器配置文件名称或 UUID
zh_hant: --profile <name|uuid> 瀏覽器設定檔名稱或 UUID

# cli.omo.installFailed
source: Failed to install %1$@. Try manually: npm install -g %2$@
ar: فشل تثبيت %1$@. جرّب يدويًا: npm install -g %2$@
bs: Instalacija %1$@ nije uspjela. Pokušajte ručno: npm install -g %2$@
da: Kunne ikke installere %1$@. Prøv manuelt: npm install -g %2$@
de: %1$@ konnte nicht installiert werden. Versuchen Sie es manuell: npm install -g %2$@
es: No se pudo instalar %1$@. Intenta manualmente: npm install -g %2$@
fr: Échec de l’installation de %1$@. Essayez manuellement : npm install -g %2$@
it: Installazione di %1$@ non riuscita. Prova manualmente: npm install -g %2$@
ja: %1$@ のインストールに失敗しました。手動で試してください: npm install -g %2$@
ko: %1$@ 설치에 실패했습니다. 직접 시도하세요: npm install -g %2$@
nb: Kunne ikke installere %1$@. Prøv manuelt: npm install -g %2$@
pl: Nie udało się zainstalować %1$@. Spróbuj ręcznie: npm install -g %2$@
pt_br: Falha ao instalar %1$@. Tente manualmente: npm install -g %2$@
ru: Не удалось установить %1$@. Попробуйте вручную: npm install -g %2$@
th: ติดตั้ง %1$@ ไม่สำเร็จ ลองด้วยตนเอง: npm install -g %2$@
tr: %1$@ yüklenemedi. Elle deneyin: npm install -g %2$@
uk: Не вдалося встановити %1$@. Спробуйте вручну: npm install -g %2$@
zh_hans: 无法安装 %1$@。请手动尝试：npm install -g %2$@
zh_hant: 無法安裝 %1$@。請手動嘗試：npm install -g %2$@

# cli.omo.installingPlugin
source: Installing %@ plugin (this may take a minute on first run)...
ar: جارٍ تثبيت المكوّن الإضافي %@ (قد يستغرق هذا دقيقة في أول تشغيل)...
bs: Instaliram %@ dodatak (ovo može potrajati minutu pri prvom pokretanju)...
da: Installerer %@-plugin (det kan tage et minut ved første kørsel)...
de: %@-Plugin wird installiert (dies kann beim ersten Start eine Minute dauern)...
es: Instalando el plugin %@ (puede tardar un minuto en el primer inicio)...
fr: Installation du plugin %@ (cela peut prendre une minute au premier lancement)...
it: Installazione del plugin %@ (al primo avvio potrebbe richiedere un minuto)...
ja: %@ プラグインをインストールしています (初回実行時は 1 分ほどかかる場合があります)...
ko: %@ 플러그인을 설치하는 중입니다(처음 실행할 때 1분 정도 걸릴 수 있습니다)...
nb: Installerer %@-tillegget (kan ta et minutt første gang)...
pl: Instalowanie wtyczki %@ (przy pierwszym uruchomieniu może to potrwać minutę)...
pt_br: Instalando o plugin %@ (isso pode levar um minuto na primeira execução)...
ru: Устанавливается плагин %@ (при первом запуске это может занять минуту)...
th: กำลังติดตั้งปลั๊กอิน %@ (ครั้งแรกอาจใช้เวลาประมาณหนึ่งนาที)...
tr: %@ eklentisi yükleniyor (ilk çalıştırmada bir dakika sürebilir)...
uk: Встановлюється плагін %@ (під час першого запуску це може тривати хвилину)...
zh_hans: 正在安装 %@ 插件（首次运行可能需要一分钟）...
zh_hant: 正在安裝 %@ 外掛（首次執行可能需要一分鐘）...

# cli.omo.noPackageManager
source: Neither bun nor npm found in PATH. Install %1$@ manually: bunx %2$@ install
ar: لم يتم العثور على bun أو npm في PATH. ثبّت %1$@ يدويًا: bunx %2$@ install
bs: Ni bun ni npm nisu pronađeni u PATH-u. Instalirajte %1$@ ručno: bunx %2$@ install
da: Hverken bun eller npm blev fundet i PATH. Installer %1$@ manuelt: bunx %2$@ install
de: Weder bun noch npm wurde in PATH gefunden. Installieren Sie %1$@ manuell: bunx %2$@ install
es: No se encontró bun ni npm en PATH. Instala %1$@ manualmente: bunx %2$@ install
fr: Ni bun ni npm n’a été trouvé dans PATH. Installez %1$@ manuellement : bunx %2$@ install
it: Né bun né npm trovati in PATH. Installa %1$@ manualmente: bunx %2$@ install
ja: PATH に bun も npm も見つかりません。%1$@ を手動でインストールしてください: bunx %2$@ install
ko: PATH에서 bun 또는 npm을 찾을 수 없습니다. %1$@을(를) 직접 설치하세요: bunx %2$@ install
nb: Fant verken bun eller npm i PATH. Installer %1$@ manuelt: bunx %2$@ install
pl: Nie znaleziono bun ani npm w PATH. Zainstaluj %1$@ ręcznie: bunx %2$@ install
pt_br: Nem bun nem npm foram encontrados no PATH. Instale %1$@ manualmente: bunx %2$@ install
ru: В PATH не найден ни bun, ни npm. Установите %1$@ вручную: bunx %2$@ install
th: ไม่พบ bun หรือ npm ใน PATH ติดตั้ง %1$@ ด้วยตนเอง: bunx %2$@ install
tr: PATH içinde bun veya npm bulunamadı. %1$@ paketini elle yükleyin: bunx %2$@ install
uk: У PATH не знайдено ні bun, ні npm. Встановіть %1$@ вручну: bunx %2$@ install
zh_hans: 在 PATH 中找不到 bun 或 npm。请手动安装 %1$@：bunx %2$@ install
zh_hant: 在 PATH 中找不到 bun 或 npm。請手動安裝 %1$@：bunx %2$@ install

# cli.omo.pluginInstalled
source: %@ plugin installed
ar: تم تثبيت المكوّن الإضافي %@
bs: %@ dodatak je instaliran
da: %@-plugin installeret
de: %@-Plugin installiert
es: Plugin %@ instalado
fr: Plugin %@ installé
it: Plugin %@ installato
ja: %@ プラグインをインストールしました
ko: %@ 플러그인이 설치되었습니다
nb: %@-tillegget er installert
pl: Wtyczka %@ została zainstalowana
pt_br: Plugin %@ instalado
ru: Плагин %@ установлен
th: ติดตั้งปลั๊กอิน %@ แล้ว
tr: %@ eklentisi yüklendi
uk: Плагін %@ встановлено
zh_hans: %@ 插件已安装
zh_hant: %@ 外掛已安裝

# cli.omo.retryingInstallCleanState
source: Retrying %@ install with a clean shadow package state...
ar: تتم إعادة محاولة تثبيت %@ بحالة حزمة ظل نظيفة...
bs: Ponovo pokušavam instalaciju %@ s čistim stanjem shadow paketa...
da: Prøver %@-installationen igen med ren skyggepakketilstand...
de: %@-Installation wird mit bereinigtem Shadow-Paketstatus erneut versucht...
es: Reintentando la instalación de %@ con un estado limpio del paquete sombra...
fr: Nouvelle tentative d’installation de %@ avec un état de paquet shadow propre...
it: Nuovo tentativo di installazione di %@ con uno stato pulito del pacchetto shadow...
ja: クリーンなシャドウパッケージ状態で %@ のインストールを再試行しています...
ko: 깨끗한 섀도 패키지 상태로 %@ 설치를 다시 시도하는 중입니다...
nb: Prøver %@-installasjonen på nytt med ren skyggepakketilstand...
pl: Ponawianie instalacji %@ z czystym stanem pakietu shadow...
pt_br: Tentando instalar %@ novamente com um estado limpo do pacote sombra...
ru: Повторная установка %@ с чистым состоянием теневого пакета...
th: กำลังลองติดตั้ง %@ อีกครั้งด้วยสถานะแพ็กเกจเงาที่สะอาด...
tr: %@ kurulumu temiz bir gölge paket durumuyla yeniden deneniyor...
uk: Повторна спроба встановити %@ з чистим станом тіньового пакета...
zh_hans: 正在使用干净的影子包状态重试安装 %@...
zh_hant: 正在使用乾淨的影子套件狀態重試安裝 %@...

# cli.omo.usage
source: Usage: cmux omo [opencode-args...] Launch OpenCode with oh-my-openagent in a cmux-aware environment. oh-my-openagent orchestrates multiple AI models as specialized agents in parallel. This command sets up a tmux shim so agent panes become native cmux splits with sidebar metadata and notifications. This command: - sets a tmux-like environment so oh-my-openagent uses cmux splits - prepends a private tmux shim to PATH - forwards all remaining arguments to opencode The tmux shim translates tmux window/pane commands into cmux workspace and split operations in the current cmux session. Examples: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
ar: الاستخدام: cmux omo [opencode-args...] تشغيل OpenCode باستخدام oh-my-openagent في بيئة متوافقة مع cmux. يقوم oh-my-openagent بتنسيق نماذج ذكاء اصطناعي متعددة كوكلاء متخصصين بـ شكل متوازٍ. يضبط هذا الأمر واجهة tmux وسيطة لكي تصبح أجزاء الوكيل أصلية لـ تقسيمات cmux مع البيانات الوصفية والإشعارات في الشريط الجانبي. يقوم هذا الأمر بـ: - ضبط بيئة شبيهة بـ tmux لكي يستخدم oh-my-openagent تقسيمات cmux - إضافة واجهة tmux وسيطة خاصة إلى PATH - توجيه كافة الوسائط المتبقية إلى opencode تقوم واجهة tmux الوسيطة بترجمة أوامر نافذة/جزء tmux إلى مساحة عمل وعمليات تقسيم في جلسة cmux الحالية. أمثلة: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
de: Verwendung: cmux omo [opencode-args...] Startet OpenCode mit oh-my-openagent in einer cmux-kompatiblen Umgebung. oh-my-openagent orchestriert mehrere KI-Modelle parallel als spezialisierte Agenten. Dieser Befehl richtet einen tmux-Shim ein, sodass Agenten-Teilfenster zu nativen cmux-Aufteilungen mit Seitenleisten-Metadaten und Benachrichtigungen werden. Dieser Befehl: - richtet eine tmux-ähnliche Umgebung ein, sodass oh-my-openagent cmux-Aufteilungen verwendet - stellt dem PATH einen privaten tmux-Shim voran - leitet alle verbleibenden Argumente an opencode weiter Der tmux-Shim übersetzt tmux-Fenster-/Teilfenster-Befehle in cmux-Arbeitsbereichs- und Aufteilungsoperationen in der aktuellen cmux-Sitzung. Beispiele: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
es: Uso: cmux omo [opencode-args...] Iniciar OpenCode con oh-my-openagent en un entorno compatible con cmux. oh-my-openagent orquesta múltiples modelos de IA como agentes especializados en paralelo. Este comando configura un shim de tmux para que los paneles de agente se conviertan en divisiones nativas de cmux con metadatos de la barra lateral y notificaciones. Este comando: - establece un entorno similar a tmux para que oh-my-openagent use divisiones de cmux - antepone un shim privado de tmux a PATH - reenvía todos los argumentos restantes a opencode El shim de tmux traduce los comandos de ventana/panel de tmux en operaciones de espacio de trabajo y división de cmux en la sesión actual de cmux. Ejemplos: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
fr: Utilisation : cmux omo [opencode-args...] Lancer OpenCode avec oh-my-openagent dans un environnement compatible avec cmux. oh-my-openagent orchestre plusieurs modèles d'IA en tant qu'agents spécialisés en parallèle. Cette commande configure un shim tmux afin que les volets d'agent deviennent des divisions cmux natives avec des métadonnées de barre latérale et des notifications. Cette commande : - définit un environnement de type tmux afin que oh-my-openagent utilise des divisions cmux - ajoute un shim tmux privé au début du PATH - transfère tous les arguments restants à opencode Le shim tmux traduit les commandes de fenêtre/volet tmux en opérations d'espace de travail et de division cmux dans la session cmux actuelle. Exemples : cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
ja: 使い方: cmux omo [opencode-args...] cmux 対応の環境で OpenCode と oh-my-openagent を起動します。 oh-my-openagent は複数の AI モデルを専門エージェントとして並列に オーケストレーションします。このコマンドは tmux shim を設定し、 エージェントのペインをネイティブの cmux split に変換します。 このコマンドは次を行います: - oh-my-openagent が cmux の split を使うよう tmux 風の環境を設定 - 専用の tmux shim を PATH の先頭に追加 - 残りの引数をそのまま opencode に渡す tmux shim は、tmux の window/pane コマンドを、現在の cmux セッション内の workspace と split 操作に変換します。 例: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
ko: 사용법: cmux omo [opencode-args...] cmux 호환 환경에서 oh-my-openagent와 함께 OpenCode를 실행합니다. oh-my-openagent는 여러 AI 모델을 전문 에이전트로 병렬 조율합니다. 이 명령은 에이전트 패인이 사이드바 메타데이터와 알림이 있는 네이티브 cmux 분할이 되도록 tmux 심을 설정합니다. 이 명령은: - oh-my-openagent가 cmux 분할을 사용하도록 tmux 호환 환경을 설정합니다 - PATH 앞에 전용 tmux 심을 추가합니다 - 나머지 인자를 모두 opencode에 전달합니다 tmux 심은 tmux 윈도우/패인 명령을 현재 cmux 세션의 워크스페이스 및 분할 작업으로 변환합니다. 예시: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
uk: Використання: cmux omo [аргументи-opencode...] Запуск OpenCode з oh-my-openagent у середовищі cmux. oh-my-openagent оркеструє кілька моделей ШІ як спеціалізованих агентів паралельно. Ця команда налаштовує tmux-прокладку, щоб панелі агентів стали нативними розділами cmux з метаданими бічної панелі та сповіщеннями. Ця команда: - забезпечує підтримку cmux для oh-my-openagent - додає приватну tmux-прокладку на початок PATH - передає всі інші аргументи до opencode Tmux-прокладка перетворює команди tmux вікон/панелей на операції робочих просторів і розділів cmux у поточному сеансі cmux. Приклади: cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
zh_hans: 用法：cmux omo [opencode-args...] 在 cmux 感知的环境中，使用 oh-my-openagent 启动 OpenCode。 oh-my-openagent 会把多个 AI 模型编排为并行工作的专职代理。此命令会 设置一个 tmux shim，使代理窗格成为带有侧边栏元数据和通知的 原生 cmux 拆分。 此命令会： - 设置类 tmux 环境，使 oh-my-openagent 使用 cmux 拆分 - 将私有 tmux shim 前置到 PATH - 将其余所有参数转发给 opencode tmux shim 会把 tmux window/pane 命令，转换为当前 cmux 会话中的 工作区和拆分操作。 示例： cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6
zh_hant: 用法：cmux omo [opencode-args...] 在支援 cmux 的環境中搭配 oh-my-openagent 啟動 OpenCode。 oh-my-openagent 同時並行 協調多個 AI 模型作為特化的代理程式。此指令會設定一個 tmux 填充程式 (shim)，使代理程式窗格成為具有側邊欄中繼資料和通知的原生 cmux 分割。 此指令會： - 設定類似 tmux 的環境，使 oh-my-openagent 使用 cmux 分割 - 將私有 tmux 填充程式 (shim) 預先附加至 PATH - 將所有剩餘的引數轉發至 opencode tmux 填充程式 (shim) 會將 tmux 視窗/窗格指令轉換為目前 cmux 工作階段中的 cmux 工作區 與分割操作。 範例： cmux omo cmux omo --continue cmux omo --model claude-sonnet-4-6

# cli.pathOpen.error.activateFailed
source: Failed to activate cmux
ar: فشل تنشيط cmux
de: Aktivierung von cmux fehlgeschlagen
es: Error al activar cmux
fr: Échec de l'activation de cmux
ja: cmux をアクティブにできませんでした
ko: cmux 활성화에 실패했습니다.
zh_hans: 无法激活 cmux
zh_hant: 無法啟用 cmux

# cli.pathOpen.error.launchFailed
source: Failed to launch cmux
ar: فشل تشغيل cmux
de: Starten von cmux fehlgeschlagen
es: Error al iniciar cmux
fr: Échec du lancement de cmux
ja: cmux を起動できませんでした
ko: cmux 실행에 실패했습니다.
zh_hans: 无法启动 cmux
zh_hant: 無法啟動 cmux

# cli.pathOpen.error.openFailed
source: Failed to open %@ in cmux
ar: فشل فتح %@ في cmux
de: Fehler beim Öffnen von %@ in cmux
es: Error al abrir %@ en cmux
fr: Échec de l'ouverture de %@ dans cmux
ja: %@ を cmux で開けませんでした
ko: cmux에서 %@을(를) 여는 데 실패했습니다.
zh_hans: 无法在 cmux 中打开 %@
zh_hant: 無法在 cmux 中開啟 %@

# cli.pathOpen.error.pathDoesNotExist
source: Path does not exist: %@
ar: المسار غير موجود: %@
de: Pfad existiert nicht: %@
es: La ruta no existe: %@
fr: Le chemin n'existe pas : %@
ja: パスが存在しません: %@
ko: 경로가 존재하지 않습니다: %@
zh_hans: 路径不存在：%@
zh_hant: 路徑不存在：%@

# cli.pathOpen.error.processMonitorFailed
source: Failed to monitor process exit
ar: فشلت مراقبة إنهاء العملية
de: Überwachung des Prozessendes fehlgeschlagen
es: Error al monitorear la salida del proceso
fr: Échec de la surveillance de la fin du processus
ja: プロセス終了の監視に失敗しました
ko: 프로세스 종료 모니터링에 실패했습니다.
zh_hans: 无法监视进程退出
zh_hant: 無法監視程序結束

# cli.pathOpen.error.timedOut
source: %@ (timed out)
ar: %@ (انتهت المهلة)
de: %@ (Zeitüberschreitung)
es: %@ (se agotó el tiempo de espera)
fr: %@ (délai d'attente dépassé)
ja: %@ (タイムアウト)
ko: %@ (시간 초과)
zh_hans: %@（超时）
zh_hant: %@ (已逾時)

# cli.reorderWorkspaces.error.emptyOrder
source: reorder-workspaces requires at least one workspace in --order
ar: يتطلب reorder-workspaces وجود مساحة عمل واحدة على الأقل في --order
de: reorder-workspaces erfordert mindestens einen Workspace in --order
es: reorder-workspaces requiere al menos un espacio de trabajo en --order
fr: reorder-workspaces requiert au moins un espace de travail dans --order
it: reorder-workspaces richiede almeno un'area di lavoro in --order
ja: reorder-workspaces には --order に少なくとも 1 つのワークスペースが必要です
ko: reorder-workspaces에는 --order에 하나 이상의 워크스페이스가 필요합니다
nb: reorder-workspaces krever minst ett arbeidsområde i --order
pt_br: reorder-workspaces requer pelo menos um workspace em --order
ru: reorder-workspaces требует как минимум одно рабочее пространство в --order
uk: reorder-workspaces потребує принаймні один робочий простір у --order
zh_hans: reorder-workspaces 的 --order 至少需要一个工作区
zh_hant: reorder-workspaces 的 --order 至少需要一個工作區

# cli.reorderWorkspaces.error.emptyOrderItem
source: reorder-workspaces --order cannot contain empty workspace refs
ar: لا يمكن أن يحتوي reorder-workspaces --order على مراجع مساحة عمل فارغة
de: reorder-workspaces --order darf keine leeren Workspace-Referenzen enthalten
es: reorder-workspaces --order no puede contener referencias de espacios de trabajo vacías
fr: reorder-workspaces --order ne peut pas contenir de références d'espace de travail vides
it: reorder-workspaces --order non può contenere riferimenti ad aree di lavoro vuoti
ja: reorder-workspaces --order に空のワークスペース参照は指定できません
ko: reorder-workspaces --order에는 빈 워크스페이스 참조를 포함할 수 없습니다
nb: reorder-workspaces --order kan ikke inneholde tomme arbeidsområdereferanser
pt_br: reorder-workspaces --order não pode conter referências de workspace vazias
ru: reorder-workspaces --order не может содержать пустые ссылки на рабочие пространства
uk: reorder-workspaces --order не може містити порожні посилання на робочі простори
zh_hans: reorder-workspaces --order 不能包含空的工作区引用
zh_hant: reorder-workspaces --order 不能包含空的工作區參照
